app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Vancer"], ["body", "The new world order <3"], ["created_at", "2016-03-21 08:56:11.777305"], ["updated_at", "2016-03-21 08:56:11.777305"]]
---
  def create
  	@post = Post.new(post_params)

  	#If able to save>
  	if @post.save

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Who is Vancer"], ["body", "Just a Rails User"], ["updated_at", "2016-03-21 09:17:40.278731"], ["id", 3]]
---
  def update
    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_post
    @post = Post.find(params[:id])